In [5]:
import pandas as pd

In [6]:
customers = pd.read_csv("C:/Users/Sol Joaquin/Documents/GitHub/Coffeeoffers/customers.csv")

In [7]:
events = pd.read_csv("C:\\Users\\Sol Joaquin\\Documents\\GitHub\\Coffeeoffers\\events.csv")
offers = pd.read_csv("C:\\Users\\Sol Joaquin\\Documents\\GitHub\\Coffeeoffers\\offers.csv")

In [8]:
customers.head()

                        customer_id  became_member_on gender  age    income
0  68be06ca386d4c31939f3a4f0e3dd783          20170212    NaN  118       NaN
1  0610b486422d4921ae7d2bf64640c50b          20170715      F   55  112000.0
2  38fe809add3b4fcf9315a9694bb96ff5          20180712    NaN  118       NaN
3  78afa995795e4d85b5d9ceeca43f5fef          20170509      F   75  100000.0
4  a03223e636434f42ac4c3df47e8bac43          20170804    NaN  118       NaN

In [11]:
import datetime as dt

In [13]:
#Convert became_member_on from string to date format into date column
customers['date'] = pd.to_datetime(customers['became_member_on'].astype(str),format = '%Y%m%d')
customers.head()

,customer_id,became_member_on,gender,age,income,date
0,68be06ca386d4c31939f3a4f0e3dd783,20170212,NaN,118,NaN,2017-02-12
1,0610b486422d4921ae7d2bf64640c50b,20170715,F,55,112000.0,2017-07-15
2,38fe809add3b4fcf9315a9694bb96ff5,20180712,NaN,118,NaN,2018-07-12
3,78afa995795e4d85b5d9ceeca43f5fef,20170509,F,75,100000.0,2017-05-09
4,a03223e636434f42ac4c3df47e8bac43,20170804,NaN,118,NaN,2017-08-04

In [15]:
customers['year'] = customers['date'].dt.year

In [16]:
customers.head()

,customer_id,became_member_on,gender,age,income,date,year
0,68be06ca386d4c31939f3a4f0e3dd783,20170212,NaN,118,NaN,2017-02-12,2017
1,0610b486422d4921ae7d2bf64640c50b,20170715,F,55,112000.0,2017-07-15,2017
2,38fe809add3b4fcf9315a9694bb96ff5,20180712,NaN,118,NaN,2018-07-12,2018
3,78afa995795e4d85b5d9ceeca43f5fef,20170509,F,75,100000.0,2017-05-09,2017
4,a03223e636434f42ac4c3df47e8bac43,20170804,NaN,118,NaN,2017-08-04,2017